{
  "main": {
    "name": "Michael DeSocio",
    "occupation": "Student @ SUNY University at Albany",
    "description": "Welcome to my portfolio!  I am a sophomore at SUNY University at Albany studying Informatics.  Prior to my endevours in the field of technology, I was a Music Education major at Ithaca College, however, due to the change in job markets with COVID-19, I thought it was best if I were to pursue a degree in Information Technology!  In my off time, you will often find me playing my Double Bass with the Skidmore College Community Orchestra and the SUNY Albany Univerity/Community Orchestra.  When I get some down time, I love to build furniture (particularly cabinets and tables) in my grandfather's workshop, or with my dad at his workshop.  Please browse through my page and drop me an email if you see something you like!",
    "image": "profilepic.jpg",
    "bio": "During my early years of grade school, I could remember times where I would come home, and just tinker with whatever was on my dad’s workbench at the time.  An old computer that was being updated and replaced. A network switch with a bad fan in place.  Regardless of what it was, I thought it was cool!  Of course, when you’re 4 or 5 you don’t ever know what these do other than you can play games on the old CRT monitor, “…but don’t touch daddy’s computer!” Progressively through my middle and high school careers, I began exploring what these technologies could do.  It really started when my dad gave me my first NAS around age 13.  This was the steppingstone that allowed me to design my rack.  I saved for years, then depleted part of my savings so I could buy a bass for music school, but after I threw in the towel on a B.A. in Music Education at my dream school at the time, I knew I had a lot of learning to do to make sure I was on top of my game.  Sure, you don’t need this equipment to start a degree in Information Technology, but if you want to expand your knowledge past a textbook and into a more real-world environment, this is pretty much one of two options: Cloud or on premises.  Of course, hybrid is also an option too. For me, data flow and network design is my passion.  Figuring out how the network will be segregated, how the backbones will link back to the core switch or router, L2 or L3 switching and where each is necessary, and many other pieces that I don’t know yet are what excite me.  As the requirements for increased speed and lower latency keep coming back, I see a small timeline before 25Gb/s and even 50Gb/s is a must for most homes and small businesses, as every service will be cloud based or decentralized on a blockchain across the world!",
    "contactmessage": "Fill this out to get in touch with me!",
    "email": "mike@desocios.com",
    "phone": "518-832-9028",
    "address": {
      "street": "(Your Street)",
      "city": "(Your City)",
      "state": "(Your State)",
      "zip": "(Your Zip/Postal Code)"
    },
    "website": "https://www.mdesocio.com",
    "resumedownload": "Resume.pdf",
    "social": [
      {
        "name": "twitter",
        "url": "https://twitter.com/mdesocio28",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/michael-desocio-bass/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/mdesocio",
        "className": "fa fa-github"
      },
      {
        "name": "email",
        "url": "mailto:mike@desocios.com",
        "className": "fa fa-envelope"
      }
    ]
  },
  "resume": {
    "skillmessage": "Basic knowledge in Python and HTML.  Current interests are in Open Source software such as PFSense, TrueNAS, and other sources. My current networking skills are self taught and are based on the use of Layer 2 managed networking gear and open source firewalls like pfSense and OPNSense.  I am looking for an internship to expand my knowledge of routing and switching in a larger, corporate or enterprise domain.",
    "education": [
      {
        "school": "SUNY University at Albany",
        "degree": "Bachelors of Science in Informatics with a Concentration in Information Technology",
        "graduated": "Expected May 2024",
        "description": "Currently on a path in my education so I can be a project manager that concentrates on heavily sensitive data and highly secure infrastructure."
      }
    ],
    "work": [
      {
        "company": "Queensbury Union Free School District",
        "title": "Summer IT Intern",
        "years": "July 2022 - August 2022",
        "description": "Work on deploying 1,000 computers to students and staff, Worked with Network Operations to deploy a more secure and isolated Wireless Network for IoT devices, Redesigned and organized the datacenter and sub-IDF closets."
      },
      {
        "company": "CreatorSphere Ltd.",
        "title": "Infrastructure Consultant",
        "years": "July 2021 - March 2022",
        "description": "Provide insight, deploy, and design infrastructure to maintain CreatorSphere's Progressive Webapp."
      },
      {
        "company": "CreatorSphere Ltd.",
        "title": "Systems Administrator",
        "years": "April 2021 - June 2021",
        "description": "Worked with a team of 15 other staff to ensure that we met deadlines to deploy our Progress Web App in 2 months!"
      },
      {
        "company": "Various Local Organizations",
        "title": "Managed Services",
        "years": "October 2018 - Present",
        "description": "Work with non-profits to find afordable ways to increase network and systems security while maintaining a budget friendly deployment of needed services."
      }
    ],
    "skills": [
      {
        "name": "Networking",
        "level": "60%"
      },
      {
        "name": "Cloud Infrastructure",
        "level": "55%"
      },
      {
        "name": "Network/Infrastructure Design",
        "level": "75%"
      },
      {
        "name": "Project Management",
        "level": "85%"
      },
      {
        "name": "Microsoft Active Directory",
        "level": "60%"
      },
      {
        "name": "Virtual Infrastructure",
        "level": "90%"
      },
      {
        "name": "Unix Systems Management",
        "level": "80%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "title": "CreatorSphere Ltd.",
        "category": "A London based startup that I helped develop the internal infrastructure for.",
        "image": "creatorsphere.png",
        "url": "https://creatorsphere.co"
      }
    ]
  }
}